ИС_СПОРТ_2022/src/Documents/ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП/ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП</name>
  <registerRecords>InformationRegister.ЗаявкиНаПроведениеСоревнованияОФПСдачаНормативов</registerRecords>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоревнования</name>
    <type>
      <types>EnumRef.ТипыСдачиНормативов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявленныеНормативы</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП/ManagerModule.bsl
#Область Инициализация

// {Рарус adilas #-7843 -Регистр сведений Заявки на соревнования ОФП 2020.07.07
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"       	, ДокументСсылка);
	Запрос.УстановитьПараметр("Период"       	, ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("УчебныйГод"      , ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Организация"  	, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Тренер"       	, ДокументСсылка.Тренер);
	Запрос.УстановитьПараметр("ВидСпорта"    	, ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("ТипСоревнования" , ДокументСсылка.ТипСоревнования);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""ЗаявкиНаПроведениеСоревнованияОФПСдачаНормативов"" КАК ИмяРегистра_,
	                |	&Период КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&Тренер КАК Тренер,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	&ТипСоревнования КАК ТипСоревнования,
	                |	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников.Спортсмен КАК Спортсмен,
	                |	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников.Норматив КАК Норматив
	                |ИЗ
	                |	Документ.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП.СоставУчастников КАК ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников
	                |ГДЕ
	                |	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников.Ссылка = &Ссылка";
	
	
	ТаблицаЗаявкиНаПроведениеСоревнованияОФПСдачаНормативов = Запрос.Выполнить().Выгрузить();  
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаЗаявкиНаПроведениеСоревнованияОФПСдачаНормативов" , ТаблицаЗаявкиНаПроведениеСоревнованияОФПСдачаНормативов);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// }Рарус adilas #-7843 -Регистр сведений Заявки на соревнования ОФП 2020.07.07

#КонецОбласти
